{"meta":{"title":"Manifestations of Chen Ting","subtitle":null,"description":null,"author":"Chen Ting","url":"https://yo1995.github.io"},"pages":[{"title":"Categories","date":"2016-08-15T08:05:04.109Z","updated":"2016-08-14T17:14:45.053Z","comments":true,"path":"categories/index.html","permalink":"https://yo1995.github.io/categories/index.html","excerpt":"","text":""},{"title":"Tags","date":"2016-08-15T08:05:04.103Z","updated":"2016-08-14T17:14:45.054Z","comments":true,"path":"tags/index.html","permalink":"https://yo1995.github.io/tags/index.html","excerpt":"","text":""},{"title":"About","date":"2016-08-20T14:37:32.546Z","updated":"2016-08-20T14:37:32.540Z","comments":false,"path":"about/index.html","permalink":"https://yo1995.github.io/about/index.html","excerpt":"","text":"About me - 关于我 An undergraduate of Beijing University of Posts and Telecommunications. Majored in Applied Physics - Experimental class of Communication Sciences Contacts - 联系方式 Email: &#99;&#x68;&#116;&#x40;&#98;&#x75;&#112;&#x74;&#x2e;&#101;&#x64;&#117;&#46;&#x63;&#x6e; LinkedIn: https://www.linkedin.com/in/ting-chen-402bab122/ Mail Address: Student Apartment #2, Beijing University of Posts and Telecommunications, No. 10 Xi Tu Cheng Road, Beijing, 100876, China Phone: Censored The main purpose of this page - 建立本页面的目的 The page aims to display several activities &amp; achievements which the author engaged in during his undergraduate period. Meanwhile, other aspects such as lifestyles, literary work, travel notes, etc. would interweave in the narration. Achievements &amp; Awards- 主要成就 Chinese Academy of Sciences - Huang Kun Scholarship National Undergraduate Electronic Design Contest - Second Prize National College Students Connected Smarter System Innovation Competition - Honorable Mention School Literature Society Annual Essay Competition - First Prize School Scholarship - Third Class × 3 School Student Innovation Training Program - Provincial Level Project School English Contest - Third Prize School Video Editing Contest - Honorable Mention School Top 10 Club Organizer Internship &amp; Volunteer - 实习与志愿服务 Americans Promoting Study Abroad (APSA) ProgramJune 2014 - August 2014 (2 months)Education: Chinese culture excahnge and scenic spots guide.Organizer and photographer Nanluoguxiang Residents’ committeeFebruary 2015 (1 week)Education: Primary physics experiments for pupils.Organizer and photographer State Key Laboratory of Information Photonics and Optical CommunicationsJuly 2015 - April 2016 (10 months)Radio Frequency &amp; Light Communication The Institute of Semiconductors of the Chinese Academy of Sciences (CAS)November 2015 - PresentWhispering Gallery Mode Micro-cavity &amp; Structures Education - 教育背景 Beijing University of Posts and Telecommunications (2013-2017)Bachelor of Science - Applied Physics High School Attached to Capital Normal University (2007-2013)High School Graduate Skills - 技能 Languages:ChineseEnglishFrench Programming Languages: Languages Description MatLab: Several major projects C: Several projects without multithreading Python: Web page processing Verilog: Two major projects Visual Basic: Several small GUI tools JavaScript: Modification of other’s projects Softwares:Microsoft Office - Word, Excel, Access, Powerpoint, Publisher, VisioAdobe - Photoshop, Illustrator, Audition, Premiere, After Effects, EncoreAltium DesignerCOMSOL MultiphysicsCorelDrawFire Dynamics SimulatorKeil for ARMMatLabModelsimMultisimOriginLabSPSSVivado (Xilinx) Hobbies - 兴趣爱好Liberal Arts - 文艺方面 ReadingActual LiteratureBiographySci-Fi Essay Composing58/60 in College Matriculation ExamFirst Prize in School Literature Society Annual Contest Classical Music - Violin Recitals Photography OperaMember of School Opera Society Movies PerformingPerformed as protagonist in the Centennial Celebration of my high school (HSACNU). Sports - 体育方面 FootballCaptain of school flag football team PostersWR/QB of PostersPart-time interpreter of nflchina Cycling Science &amp; Technology - 科技方面 Video Clipping &amp; Editing Figure Making Embedded System Signals and Systems Visualization"},{"title":"Awards Showcase","date":"2016-08-20T14:05:02.947Z","updated":"2016-08-20T14:05:02.939Z","comments":false,"path":"awards/index.html","permalink":"https://yo1995.github.io/awards/index.html","excerpt":"","text":"本科期间所获奖项与认证"},{"title":"Gallery","date":"2016-08-20T08:47:03.093Z","updated":"2016-08-20T08:47:03.085Z","comments":false,"path":"gallery/index.html","permalink":"https://yo1995.github.io/gallery/index.html","excerpt":"","text":""}],"posts":[{"title":"有关T大的一些链接 + 自己的一些反省","slug":"201608/2016-08-31-tsinghua-thoughts","date":"2016-09-01T08:13:42.034Z","updated":"2016-09-01T08:15:39.680Z","comments":true,"path":"2016/09/01/201608/2016-08-31-tsinghua-thoughts/","link":"","permalink":"https://yo1995.github.io/cht/2016/09/01/201608/2016-08-31-tsinghua-thoughts/","excerpt":"努力就可以上清华北大吗？","text":"努力就可以上清华北大吗？这一年 by byvoid 科索沃 再见清华学子怎么说呢，很难开口。 一直对自己人生的定位不够明确，只有一些虚无缥缈的目标，却并没有切实的规划。总喜欢由着性子胡来，相信命运的安排。到底自己想努把力再上一个台阶，还是另辟蹊径走一条无人问津的羊肠小道。 {: .hascaption} 又想起这段话了。自己何尝不是这种人呢。现在想来，要是当年侥幸考进清华学了一个工科专业，那可预见地将被无数的同龄人虐的死去活来、生不如死。毕竟，考进清华只决定了你的下限。上限？根本没有上限。在那所学校里，有着大把大把出生在繁星中的灵魂。 有点庆幸自己来这间普通的学校了。自己便是上限，就算荒废四年也依旧领跑身边的人。这种感觉就像闪电在二百米赛道上睥睨周遭的爽快。躺在自己的老本上无需拼搏，也还能凑合过个日子。就算身边少数人后来居上了，也可阿Q式地自我安慰一下“前浪死在沙滩上”。 挺无赖的，真的。前进路上总是回头有什么意义呢？过去的一切和现在的你有任何关系吗？ 清华里想做个优质毕业生挺难的。一面是早已星辰大海的同龄人中的佼佼者，一面是同样努力但起跑就套你一圈的竞争者。想象得出那种落差感，而弱菜如我最害怕这种无力反抗的压制了。同班同学干净的卷子上写满云淡风轻，舍友或许是顶会审稿人。妈呀，这种与我何干的碾压真的很残酷。 人难免天生有自怜的情绪，唯有时刻保持清醒，才能看清真正的价值在哪里。 这些天来为了逃避现实，疯狂浏览了近百个独立个人博客，几乎都是未被收录或是未对SEO优化的。或许这些才是真正的技术博客，仅对自己负责。兜兜转转今天看到了byvoid前辈的博客，还是会有几分无谓的感慨。 从小一直是中上游选手，撞大运有过几次全场最佳的表现，但大多数情况都是陪太子读书。甚至都没做过清华的梦，直到高三下半学期才被老师强塞进一个清华梦。那时候也有侥幸心理，觉得考上清华大不了当个末等生混个文凭，也算是金字招牌呀。现在回想起来，要真是考进来，可能现在就没机会坐在这里写博客了，而是拿了居士证到云顶天宫跳大仙儿去了。 要认清自己，而后才能有明晰的人生规划。绝大部分人一生都在做自己不喜爱或是不擅长的事，只为了糊口或和消磨时光。我还能依稀记得一位十分聪明却厌恶编程的学长的话： 在高中学信息学编程时，我给自己留下了很大的心理阴影。当时的高中有各种竞赛，但不像数学、物理那么有人气，我当时参加的信息学竞赛在全年级只有我一人。所以高中很多时间，我是一个人在一个空房间，自己一个人没完没了地编程。做为一个高中生来讲，我太孤独了，这份心理创伤到现在还留着疤。 虽然我没有那么高的智力水平，但仅在我个人能够理解的范畴内，还是能体会到这种孤独和无助。而BVY前辈能从中得到快乐与充实，真的是幸运至极！ 别人的博客回到独立博客的话题上来，自负自怜或许是我这几天看到的最多的东西了。 每次翻到一个个人博客，除了浏览archive和tags了解博主身份和工作方向外，看的最多就是about页面了。技术类内容无需多言，翻到的博客中93%以上都是从事编程相关的工作的。极大多数博主在简介前几行就直截了当点名身份：IT人员，全栈工程师，码农，单身，年轻男性，具有本科或硕士同等以上学历，开发过如下项目，喜好文艺体育释迦摩尼。千篇一律，甚至连对Taoism和静心养性的爱好都会有雷同。下面的disqus评论区里更是老乡见老乡。找到点当年进卡吧的感觉了。要是上stackoverflow、quora、或是segmentfault、v2ex、csdn之类站点或许也会有类似的体会。 何曰自负？舞文弄墨闪烁其词是也。虽说很多中文博客号称这个3.0啦那个4.0的，但很多技术上关键问题避重就轻。多是大段转载，少是自主翻译修订，极少是个人突破创新。也可能是我眼界受限吧，不在那个圈子里可能看不到更高明的人士。所以此次有幸看到BVY前辈的博客博文，如此详尽而客观冷静，平铺直叙却无出不闪烁着理智之光，真的让我有点“受宠若惊”了。百度索引到的信息稂莠不齐，独立博客虽说高质量的文章更多，但依旧难称高效。偶尔能看到这样的内容真让人喜悦。 不得不在此说一下关于信息获取能力的问题了。所谓读万卷书行万里路，如今的科技让我们足不出户便知天下事，极大地提高了信息量。然而高效的信息获取仍旧是一件奢侈之物，倘若没有一点特权或是特别的能力依旧难以达成。有幸和信息产业沾点边，能获取的信息也相应地比其它行业的人稍多。看一个人的博客，也能依稀看到背后作者，对于信息驾驭能力的高低。 无权指责这种自怜，并且认为这种对自己的尊重甚至应该更多地得到保护。每个人都在自己的领域里获得了自信，从而乐观而积极地发挥自己的能力，如此社会的效率也能得到长足的提升。 比较稀有的是女博主，或是带有明显女性特征的博主。独立博客缺少女性的感性思维。有些博主确实撰写心路历程的博客，但依旧是像手册或是文档那样平铺直叙，虽然充实但难得让人产生心动之感。附一个好不容易看到的女产品经理，确实和自己这种思维有区别，诸君自行体会。 我自己我的智力水平并不出众，因而自始至终我都有比较好的自知之明。小学时奥数测试，满分140我得了100分，但我一点也不骄傲，因为人家得了140分。那时还没有现在流行的说法，但我却已经能够理解所谓“别人考100分是因为试卷只有100分”的感觉了。 好在这种人在我的身边一直是少数。从小到大上的学校都是中等偏上型的。身边的人中等偏上，各有所长但尚在可以感知的范畴之内；学得课程中等偏上，稍微超纲但找点虐后立马回到现实；学校中等偏上，全市十名每年清北将将20人，既没有人大附中上中南外那种身边全是哈佛耶鲁斯坦福的碾压式peer pressure，也没有如皋中学南通中学海门中学启东中学的巨大智商压力。一切都是可控的，可知的，可爱的，这既让我变得三心二意，又让我变得对别人的杰出承受能力相对较差。俗称嫉妒 我自私吗？一直以来这个问题在我心中有着明确的答案：是的，我很自私。但是却真的说不出来自己哪些地方自私，更像是一种全方位的敝帚自珍。正像前文所说的，大部分理工男性具有自负自怜的特征，总还有点自己能独当一面的幻想。我也一样，连这些本性的弱点都无法克服，确实也难以顾及更多外在的事物。从这个角度看来，自私或许只是一种能力低下的体现罢了。 因为智力水平的平庸，一路走来我都极力避免在我不擅长的事物上加技能点。尤其是当我看到自己解了一天的数学题人家几分钟就搞定时，我决心放弃今后所有数学考试的最后一题最后一问。曾经不止一次质疑过上述决定，甚至在中考撞大运遇到一道会做的最后一题，但更多次的经验与概率知识结合，一步步夯实了这个决定的前提：我的数学能力较为平庸。从此引申得出，我的智力水平依旧不高。 由于数学能力低下，补偿式地拥有了较好的感知能力。倾向于用图片而非公式理解问题，倾向于凭感觉而非纯粹理性去认知世界，倾向于夹带私货而非客观公正。能记住公式与定理出现在什么场景下，譬如一个雾霾爆表昏昏欲睡早晨吃了豆沙馅饼的早课上第五张幻灯片记述了书中第三章第二节的一张真值表，却忘记了如何使用它。一言蔽之，数学差，记忆力差，喜欢让感性思维恣意驰骋策马狂奔。 有一点崩坏的强迫症。些许排斥整数，所有音量设置，闹钟设置，完成度设置都本着能质数就绝不合数的规律。看上喜欢的东西，只要毋需付出什么实际成本，凭脑力和体力能够换来的一概会去硬磕到底。现在的博客主题便是这般。先是千挑万选选了个小众的美观的主题自己闷头改改改，改到了同主题里比已知的最高水平高那么一丢丢。后是见异思迁不惜一切代价扒下来半个人家的主题改改改，改到现在的模样。编程序本着能跑起来绝对不加一丁点鲁棒性，能打表绝不计算的幼稚心理，竟然也开发了几个小的工具，做了几个有点分量的项目。又容易从这里想歪了，难道社会上还有那么多空子可以钻？偷点空闲也不至于混得很差？ 再叙清华总是废话太多…… 当初我和清华的差距并不大，现在仍旧不大。当初的同学在做的事，现在考上清华的同学在做的事，和我并无二致。 差距大的，则是自始至终从来不可能赶上的那些人。他们的起跑就套我一圈，整场比赛都比我跑得快，那我还拿什么追赶呢？ 不如坐下来，静静观赏这场比赛吧。 这么多年受过的挫折经历过的逆境，总会释然： 在事件视界上独一无二的一点，我的目光与他交汇，相视一笑。看过别人的表演，继续自己的旅程，如此可好？","categories":[{"name":"Life","slug":"Life","permalink":"https://yo1995.github.io/categories/Life/"}],"tags":[{"name":"lifestyle","slug":"lifestyle","permalink":"https://yo1995.github.io/tags/lifestyle/"},{"name":"TsingHua","slug":"TsingHua","permalink":"https://yo1995.github.io/tags/TsingHua/"}]},{"title":"考古系 - Joe Montana & Jerry Rice","slug":"201608/2014-11-16-Joe-Montana-Jerry-Rice","date":"2016-09-01T08:13:42.032Z","updated":"2016-09-01T08:15:17.357Z","comments":true,"path":"2016/09/01/201608/2014-11-16-Joe-Montana-Jerry-Rice/","link":"","permalink":"https://yo1995.github.io/cht/2016/09/01/201608/2014-11-16-Joe-Montana-Jerry-Rice/","excerpt":"这辈子没怎么追过星，一大原因就是喜欢的明星离我实在太遥远。无论是远在天国的邓丽君、梅姐、塞纳、霍洛维茨，还是远在天边的凯文科斯特纳、德尼罗、曼宁……去年哈恩女神来的时候，几乎花痴了一个星期&gt;_&lt;。同样的，当初2013年和2014年乔蒙塔纳和杰里莱斯相继造访中国并来到我们腰旗的比赛时，真的是好兴奋！","text":"这辈子没怎么追过星，一大原因就是喜欢的明星离我实在太遥远。无论是远在天国的邓丽君、梅姐、塞纳、霍洛维茨，还是远在天边的凯文科斯特纳、德尼罗、曼宁……去年哈恩女神来的时候，几乎花痴了一个星期&gt;_&lt;。同样的，当初2013年和2014年乔蒙塔纳和杰里莱斯相继造访中国并来到我们腰旗的比赛时，真的是好兴奋！Joe Montana, known as “Cool Joe”, is one of the greatest quarterbacks in NFL history. He got a perfect winning streak - winning all his 4 Super Bowl appearance. Meantime, Jerry Rice was THE GREATEST wide receiver of all time. His total yardage and touchdown record lead the league’s franchise record for more than two decades, and nobody - I mean not possible anybody - could even reach his record. The best WRs nowadays who lead the active record list are almost 10,000 yards shorter. His unbelivable long career was also a greatness to be mentioned. Playing with 3 more quarterbacks, winning 3 SBs with Joe and Steve for the 49ers, dominating the entire 80’s and half of the 90’s, being much better than the average even in his last season… Those two are really living legends! 去见酷毙乔的那次还是挺偶然的。2013年刚被大学录取不久，还没有正式成为北邮橄榄球队的成员。只是NFL官方微博的一条推送，就让我下定决心花了400元巨款，只为见偶像一面，当然，还有超棒的自助餐和一个赠球。其实当时是有乔在场的微型训练营的，只是我们并没机会参加，而且在上海的活动明显比北京丰富得多。当然，第二年莱斯来的时候情况完全逆转啦~ .JPG “Me with Joe at Kerry Hotel”){:.hascaption}.JPG “Joe Cool”){:.hascaption}.jpg “Joe on the court”){:.hascaption} That night of greeting with Joe was not perfect, especially with my obsurd question choice. I’d have posed a much better one than that of his life after retirement. I could’ve asked him about Elway, I could’ve asked his about his tight spin and his dicisiveness. Still, he was just so cool to talk about his experiences. After the dinner, everyone who want to take a photo with him gained a chance. So that’s the story of that picture above. 当然啦，那天的晚餐确实很好，但这并不是来的主要目的。还在场认识了几个NFL中国的行政官员，不过后来也没联系了。现在在做NFL官网的兼职翻译，有机会还是慢慢来吧，喜欢一项运动不该是十分钟热度。 The other day in November 2014, I got the news that Jerry Rice will be at the court where we just played our weekly tournament. That was a blast! I went as quick as possible to fetch my Wilson authentic ball with Joe’s signature on it, hoping to gather all those two names on the same ball. As you can see in the pictures below, I did it! .JPG “Joe Cool and Jerry 80’s sig.”){:.hascaption}.JPG “Jerry Signed me!”){:.hascaption}.JPG “Jerry with the kid”){:.hascaption}.JPG “Team senior player with Joe”){:.hascaption} 这段正好轮到中文了，那就着重写一下吧。莱斯真的人特别好，很关心橄榄球运动的发展。无论是我们这种球员，还是对橄榄球一无所知的小朋友，他都一视同仁，充满了热情地say hello，整场训练营加上签名，他一直都在鼓励我们这群菜鸡球员要加油，好好打，接到每一个传球都为我们鼓掌，hurdle的时候也非常努力地调动起来气氛。签名的时候和每一个穿了队服的球员认真地握手。不得不说 他的手劲儿还真的很大。怪不得我们经常接球脱手而职业球员不会，都是练出来的。莱斯以他现在的身体状况，我甚至觉得继续上场每场拿个100码完全不是问题。不仅体型保持的很好，手感依旧，而且除了斑白的鬓角和胡须外完全看不出是个年逾五十的中年人了。关键是，他的眼里还有那种光芒，或许可以称为运动家的精气神，你看到那种眼神，就觉得我们今天能赢球的感觉。 .JPG “Me with helmet on”){:.hascaption}.jpg “Mini camp by Jerry”){:.hascaption} 很有幸在camp里接到两次Jerry大叔的传球，还有一次接球脱手……右侧三步四十五脱手，我至今记忆犹新…… .jpg “Elegance”){:.hascaption}There is another photo of Jerry Rice. Maybe you could perceive what I mentioned above. “The Light of Sportsmanship” That’s why we play. That’s the glamour of football.","categories":[{"name":"Life","slug":"Life","permalink":"https://yo1995.github.io/categories/Life/"}],"tags":[{"name":"football","slug":"football","permalink":"https://yo1995.github.io/tags/football/"},{"name":"lifestyle","slug":"lifestyle","permalink":"https://yo1995.github.io/tags/lifestyle/"},{"name":"sports","slug":"sports","permalink":"https://yo1995.github.io/tags/sports/"}]},{"title":"考古系 - 2014.8 APSA Program","slug":"201608/2014-08-28-APSA","date":"2016-09-01T08:13:42.031Z","updated":"2016-09-01T08:14:35.139Z","comments":true,"path":"2016/09/01/201608/2014-08-28-APSA/","link":"","permalink":"https://yo1995.github.io/cht/2016/09/01/201608/2014-08-28-APSA/","excerpt":"","text":"嘛……简单记录一下当初的日子，也许有人看呢？ In summer vacation of 2014, I, together with my friends, joined a volunteer program called APSA(Americans Promoting Study Abroad). In the program, we two males staged as daily photographer and tour guide for the American pupils. Our femalecompanion served as Chinese and Chinese culture tutors, guiding them to have a better knowledge of what they’ve learned in class and share the real trends about Chinese culture. 两个月（其实是一个半月啦）的时间过得很快，尽管每天北京都是三十多度的高温，但这并不影响我们到处撒欢。不上课的时候，我们带着他们去了很多地方，像故宫、颐和园，还有中国美术馆。在这些地方，或许除了看风景以外，我们还能更好地为他们讲述一些真正的中国文化吧。 {:.hascaption}{:.hascaption} During our visit to the Summer Palace, we told them the history of Eight-Nation Alliance who invaded in China, which caused the demolition of the Old Summer Palace. Huge casualty and enormous loss of the ancient Chinese treasures was made by the Alliance Army. After learning this part of history, they really had a brand new comprehension of this place. 除了出游，我们还进行了诸多课内课外的活动。作为摄影师，我和搭档在课堂上记录下每个美国学生的成长：从对中文和中国文化的一无所知，到尽力模仿着老师的语调说出“你好”，“谢谢”等常用语，再到写下自己的第一幅“中国书法”……一天一天，在学习之中，这些美国学生开始一步步了解中国。 Meanwhile, we volunteers definitely had some enjoyable time with them. We hold several activities such as making dumplings, playing Chinese tongue twisters, playing Majong, telling them how to use VPN, etc. Urged to check their own twitters and facebook pages, the were ‘dominated’ by the possessor of VPN ;-). {:.hascaption}{:.hascaption} Finally, the program came to its end. 我们和他们最后在一起聚会，为了这一个多月一起学习生活、交流文化、了解彼此的日子。多么希望两国年轻人之间能有更多这样的交流，从而少一点分歧，少一点仇视，像朋友一样互相勉励共同进步…… {:.hascaption}{:.hascaption} For more details please check the video above.","categories":[{"name":"Life","slug":"Life","permalink":"https://yo1995.github.io/categories/Life/"}],"tags":[{"name":"lifestyle","slug":"lifestyle","permalink":"https://yo1995.github.io/tags/lifestyle/"},{"name":"education","slug":"education","permalink":"https://yo1995.github.io/tags/education/"},{"name":"volunteer","slug":"volunteer","permalink":"https://yo1995.github.io/tags/volunteer/"}]},{"title":"考古系 - 大宅门","slug":"201608/2015-02-27-dazhaimen","date":"2016-09-01T08:12:23.541Z","updated":"2016-09-01T08:14:19.117Z","comments":true,"path":"2016/09/01/201608/2015-02-27-dazhaimen/","link":"","permalink":"https://yo1995.github.io/cht/2016/09/01/201608/2015-02-27-dazhaimen/","excerpt":"黄春","text":"黄春济南 遗嘱 田木 销毁 堂会 大宅门 终于看完，45*40mins=30hrs的总观影时间，终于算是了了一桩心愿。 很久之前，就想把大宅门补上了。不为别的，就为看看京韵最浓的电视剧到底有多精彩。 所有的技术层面评价已经于上一篇简单谈过了，这里不必再提。随意记下观影感想吧。 首先，这是一部充满正能量的电视剧。 正如片中所讲“这不争气中就透着那么一股子争气”，这部剧在充斥着负能量的岁月中倔强地描绘出正能量。从违抗父母之命，打破旧社会礼制的出格举动，到与封建帝制的不合理斗争，黑白通吃洗清冤情，再到挺直腰板，宁死毋当亡国奴。三代人，一个家族，映射出整个民族不屈不挠为命运抗争的风骨。虽然是富商之家，但其始终保持了为人的气节，从不见利忘义，欺压百姓。尤其是最后白颖宇的总结，和盘托出了全剧的主旨，即爱国，爱家之家国情怀。 其次，这是一部讲述北京精神的剧。 爱国，创新，包容，厚德。尽管并不能完全涵盖北京的品质，但这四个词在这部剧中，都被极佳的展现出来。 不克扣工人一分一毫，老铺遭难仍舍利取义，于己有恩者定涌泉相报，此乃厚德； 小不忍则乱大谋，与冤家冰释前嫌，不再斤斤计较，此乃包容； 独创三十二张秘方，走股份方法改革之路，开怀接纳新鲜事物，此为创新； 国家兴亡匹夫有责，宁死不做亡国奴，此乃爱国。 再次，这是一部纯粹京味儿的剧。 现代小说，能够沉下心创作的越来越少。连一个社会的文学，字里行间都充斥着拜金主义，无节制的自由，纸醉金迷的萎靡，无病呻吟的哀怨，那真的是非常危险。还好，我们仍旧能看到，总有人会站出来制止这堕落的势头，用或尖锐或厚重的文章剜掉病灶，荡涤心灵。 京味儿浓郁？ 最近在看的《繁花》中描绘的老上海变为新上海的岁月，那真是让人拍案叫绝。从吴侬软语最极端的做作，到上海宁动口不动手的矫情，甚至大世界的灯红酒绿，阴暗潮湿的弄堂里嘈杂着流言蜚语。真正的生动，身临其境的小上海。辅之以张爱玲的《小团圆》，便知那个年代不同人的命运石如何的交织在上海滩的。精彩绝伦。 《大宅门》这部剧亦是这个套路。以同仁堂家族历史为蓝本，填进时代的种种人事，描绘的便是世间百态。最底层的戏子到顶头的老佛爷，全都画了个遍。多而不杂，简而不糙，寥寥数笔，便是一条好汉。除去白文氏，白景琦，白颖宇等几个主要白家的人物外，诸如皮头儿，胡总管，郑老屁，季先生，白玉芬，乃至太监王喜光，常公公，田木，个个儿都是一身的戏。出场人物如此之多，却能做到大部分人都有鲜明的性格，可见剧组在剧本编排，演员在场外都下足了功夫。 “张艺谋在剧中饰演太监李莲英，从换上服装的那一刻起，张艺谋就进入了角色，跟导演说话也像请示慈禧太后一样。” “平时从不沾酒的田壮壮为了更好地进入角色，为了演出老田木喝完白府药酒后醉酒的感觉，破例先喝了几口白酒。” “为了演好白文氏这个年龄跨度近60年的角色，斯琴高娃在戏还没有开拍前就开始了减肥的工作。” 如此这般。除去台词中细心推敲的京腔京韵，这一种的古道热心肠，为了追求卓越的固执，还真有北京这座城的气韵呢。 《大宅门》于2000年开机，它是中国第一部高清晰度电视剧，开创了用高清晰度摄像机拍摄电视剧的先河。2001年该剧在中央电视台首播，并以17.74点的收视率夺得2001年央视年度收视冠军。毋庸置疑的，这部剧倾注了多少人的心血，它注定会成为一部经典。 官媒的评价： 该剧可以称得上是现代版的《红楼梦》。 郭宝昌通过在大宅门中成长的26年的经历，把大宅门里的恩恩怨怨，生生死死，血泪情仇，几度兴衰， 淋漓尽致地呈现给了观众。 央视网评 《大宅门》的故事从清光绪年间讲起，以北京一个卖药兼行医的大宅门的历史变迁为主干，讲述了一群人的恩怨沧桑。这类故事在中外影视作品中很多见，要有自己的特色，不是件容易的事。《大宅门》却能标新立异，把故事说得精彩纷呈，每一集都有悬念。 《北京日报》评 《大宅门》在人物形象塑造上相当成功，每个人都不是简简单单的，都有其存在的理由（陈建功评）。该剧人物 众多，商人、医生、王爷、贝勒、格格、太监、丫头等等，虽不可能个个鲜活，但一些主要人物是栩栩如生，非常有特点的。特别是白文氏、颖宇、景琪、杨九红，因重场戏多，性格更如浮雕一般清晰，其他次要一点的人物也很生动。 《北京日报》评 《大宅门》的可贵，不仅在于写了宅门的变迁、人物的命运，还在于透过大宅门写了历史，戊戌变法、义和团运动、庚子事变、辛亥革命、张勋复辟、五四运动、革命军北伐、卢沟桥事变等等，这些近现代的历史事件都在戏里或隐或显的有反映，而且这些历史事件也对大宅门的生活构成影响。国家兴亡和家庭、个人是这么直接地发生着关系，剧中人物的生活、思想不得不跟着时世的变化而调整，显示了作者郭宝昌的历史眼光。 《北京日报》评 《大宅门》是一部纯粹的京味电视剧，剧中人物对白用的是北京话，连主题曲也用上传统京韵大鼓和京剧唱腔。北方观众自然容易接受，但南方观众则不一定会买账。 《南方日报》评 南北差异？这事儿可得说道说道。南派似乎愈来愈走向普世的个人主义，忽视了传统文化中格致诚正的一部分。再提也罢。 乱世风云乱世魂， 平生多磨砺，男儿自横行 有情义有担当，无依无傍我自强 这一身傲骨敲起来铮铮的响！","categories":[{"name":"Movie","slug":"Movie","permalink":"https://yo1995.github.io/categories/Movie/"}],"tags":[{"name":"movie","slug":"movie","permalink":"https://yo1995.github.io/tags/movie/"},{"name":"TV","slug":"TV","permalink":"https://yo1995.github.io/tags/TV/"}]},{"title":"Windows 文件夹同步工具 - SyncToy + Shell 同步脚本","slug":"201608/2016-08-29-synctoy-windows","date":"2016-09-01T08:09:53.738Z","updated":"2016-09-01T08:11:56.514Z","comments":true,"path":"2016/09/01/201608/2016-08-29-synctoy-windows/","link":"","permalink":"https://yo1995.github.io/cht/2016/09/01/201608/2016-08-29-synctoy-windows/","excerpt":"由于博客需要push到多个托管平台上，因而post内容和插图需要同步。之前尝试使用git，但不是特别好用，希望寻求一个合适的、简洁易用的图形化界面软件。同时，为了更方便地一件部署，希望写个shell脚本双击即可部署，免去敲代码的麻烦。","text":"由于博客需要push到多个托管平台上，因而post内容和插图需要同步。之前尝试使用git，但不是特别好用，希望寻求一个合适的、简洁易用的图形化界面软件。同时，为了更方便地一件部署，希望写个shell脚本双击即可部署，免去敲代码的麻烦。 SyncToy SyncToy 是由微软推出的一款免费的文件夹同步工具。主要的功能就是用于本地同步两个文件夹的内容。 Synchronize ：在这个模式下，SyncToy会使得两个文件夹完全一致，无论在哪一个文件夹中操作，对应的操作相当于都在另一个文件夹中执行了一次。（也就是我们所说的“同步”）。 Echo：echo模式的效果是，使得在左边文件夹中新增加的和被改变的内容会被备份到右边的文件夹中。在左侧被重命名的文件以及被删除了的文件，将也会在右侧的文件夹中删除。（这种模式与synchronize很像，差别就在于这里只会从左边同步到右边，右边的操作对左边的文件夹无效~） Contribute ：也就是我们常说的“增量备份”，相当于在echo的基础上，把所有的删除操作都屏蔽掉了，只要在左边文件夹中存在过的文件都会在右侧文件夹中存在。 实际用下来非常好用，同步很迅速。 Shell比较简单就不解释了…… :blush:12345678cd &#123;blogroot&#125;jekyll buildcd &#123;destination&#125;git add .read -p \"键入今日提交次序：\" orderread -p \"提交原因：\" reasongit commit -m \"$(date +%Y%m%d) $order coding commit for $reason\"git push","categories":[{"name":"Tools","slug":"Tools","permalink":"https://yo1995.github.io/categories/Tools/"}],"tags":[{"name":"helloworld","slug":"helloworld","permalink":"https://yo1995.github.io/tags/helloworld/"},{"name":"Windows","slug":"Windows","permalink":"https://yo1995.github.io/tags/Windows/"},{"name":"tools","slug":"tools","permalink":"https://yo1995.github.io/tags/tools/"},{"name":"shell","slug":"shell","permalink":"https://yo1995.github.io/tags/shell/"},{"name":"scripts","slug":"scripts","permalink":"https://yo1995.github.io/tags/scripts/"}]},{"title":"Using PIL(Pillow) to generate thumbnail","slug":"201608/2016-08-27-python-PIL-101","date":"2016-08-28T13:43:16.375Z","updated":"2016-09-01T08:32:01.294Z","comments":true,"path":"2016/08/28/201608/2016-08-27-python-PIL-101/","link":"","permalink":"https://yo1995.github.io/cht/2016/08/28/201608/2016-08-27-python-PIL-101/","excerpt":"缘起相册，我更换到这个主题。然而，不完美终究还是不完美。不像CMS类博客，纯静态虽然快，但用起来还是有诸多不便。比如说相册功能，无论如何简化，你还是需要一行一行插入上传后图床上的照片网址。","text":"缘起相册，我更换到这个主题。然而，不完美终究还是不完美。不像CMS类博客，纯静态虽然快，但用起来还是有诸多不便。比如说相册功能，无论如何简化，你还是需要一行一行插入上传后图床上的照片网址。为了免去这份劳累，写个脚本生成网址看来是必须的咯。于是，第一版脚本的思路就诞生了。 第一版v1.0第一版代码对应的是先前的博客、自己设计的相册功能用的。因为不太会js所以相册很简单，因而Python也写的很简洁。 主要是为了生成对应的照片网址。因为我把所有图片传到了另外一个repo避免单一repo过大，所以引用照片时需要使用rawcontent对应的github网址。 需要实现的功能有： 遍历指定目录下所有图片类文件的文件名 将文件名字符串进行处理后变为对应的网址 很简单，不是吗？篇幅缘故，只在文末贴最新版代码。这里指明几个所需函数：12path = os.getcwd() # 得到当前的绝对路径，windows下生成的字符串是反斜杠os.path.isfile(dir) # 返回值为真伪，确定文件是否存在 第二版v2.0用了一段时间后，转到这个相册来啦。虽然布局变为了响应式，风格也炫酷了很多，但本质上并没有改变。几乎所有的静态博客解决方案都有用到fancybox这个js插件，以优雅地展示图片。 因而，我的代码不需要怎么变动，就可以直接迁移到这个博客上来啦总还是有些变化。因为这个博客支持caption显示，因而代码改变一点1link = yourlink + '\\r\\n' + '&#123;:.hascaption&#125;' 需要注意的是，三种常用桌面系统对换行符的定义不同。windows是CRLF而Macintosh和Linux是LF，windows下编程需要注意一点。或者使用现代化的文本编辑器亦不会因此产生问题，如sublime和notepad++。 第二版v2.1上线一段时间里，都很安逸。尽管页面访问有些慢，但我并没在意。 后来实在是慢的不行了！主页载入平均时间十五秒！天啊:scream:在发现元凶之前，我还以为是图片造成的。的确博客中有很多图片可能会导致载入过慢。于是我便打起了优化图片的主意。 首先是缩小图片尺寸。博文配图统一缩小到长边1800像素以内。图片质量保留70%足够看了。另外就是主页图，别用png带alpha通道了，直接压成jpg中等质量。灰度图真的无所谓的。 优化了一番以后，并没有特别的好转。还是F12一下。 这一看不要紧，原来之前相册载入的时候都是原图。这还了得！每次点开相册需要把所有的原图都载入后才能显示。GIF相册一共40+MB，配上github时不时抽风的网速……之前最长载入花了三分多钟还没成。原来真凶在这里！ 如何解决这个问题呢？催生了第二版代码的第一次迭代； 能够生成缩略图 能够正确resize各种类型的图片 能够生成缩略图路径 先从简单的说起。缩略图路径我想了一想，还是生成在不同路径下用相同文件名比较好。这样在增减原始图时不会因为同目录下有缩略图而产生麻烦。 其次是resize。查了一下Python最常用的图像处理库，貌似就是Pillow了。功能够用，效率够高，很好。只是当我写完代码才想到，其实是可以用MATLAB的，那样更熟悉一些……只是运行启动时间更长了。 最后是缩略图。有几个要求： 匹配最长边相等 比例不能变 画质尽可能好点 画质方面，查了文档后发现有bilinear、bicubic和ANTIALIAS三种选项，其中最后一种最佳。 比例方面，当时不知有现成函数，于是自己写了个判断，最长边的问题也一并解决：123456789w, h = img.sizeif w &gt; h: div = float(w)/h h = int(320/div) img.resize((320, h),Image.ANTIALIAS).save(os.path.join(small_path, f))else: div = float(h)/w w = int(320/div) img.resize((w, 320),Image.ANTIALIAS).save(os.path.join(small_path, f)) Python2.7和Python3有诸多不同，浮点数这个就是有点烦。当时debug花了好几分钟才发现是这里有问题。 第二版v2.2上面一个版本运行很顺畅。上线以后本以为没问题，可一刷新问题又来了：ul li在垂直对齐时存在一些问题，导致有些图片高，有些图片低。反复试验后发现，横版图片会以上边缘对齐左右居中，而竖版图片则会垂直占满li并左右居中。 调了一小时css无果，遂想到了替代方案：给thumbnail加白边，全都变成1:1比例图片。这招其实我也在以前其它工程中使用过，这里拿来恰巧合适。 继续列需求： 给缩略图加白边形成正方形 - 匹配各个图片长宽 缩略图加边框后居中 研究了一下PIL的函数，并没有合适的拼接类函数，裁剪的倒是很多。最后选用了paste。另外就是改用了thumbnail类，直接压图无需自己算参数。浮点和整数转换出了一点小差错。对于图片而言像素长宽均需为整数。用了一个小技巧，用input函数来暂停程序，类似system(“pause”);异曲同工。 最新版代码于下方更新v2.2 - 加入了缩略图加白边居中功能v2.1 - 加入了缩略图功能v2.0 - 加入了新的链接生成 v1.0 - 初始代码，生成链接 最新版代码12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849505152535455565758596061from PIL import Imageimport osimport os.path import sys def GetFileList(dir, fileList): newDir = dir if os.path.isfile(dir): fileList.append(dir.decode('gbk')) elif os.path.isdir(dir): for s in os.listdir(dir): #if s == \"xxx\": #continue newDir=os.path.join(dir,s) GetFileList(newDir, fileList) return fileList# path = os.getcwd()fname = raw_input(\"Please input the dir: (example: awards cannot process GIF!)\\n\")path = 'C:\\Program Files\\Git\\usr\\yo1995.github.io\\photos\\page-backup\\\\' + fnamelcur = len(fname) + 2small_path = (path[:-1] if path[-1]=='/' else path) + '_m'print small_pathimgblank = 'templ.jpg'thumbsize = (600,600)if not os.path.exists(small_path): os.mkdir(small_path)for root, dirs, files in os.walk(path): for f in files: fp = os.path.join(root, f) img = Image.open(fp) imgb = Image.open(imgblank) (sizeblankw , sizeblankh)= imgb.size savepath = os.path.join(small_path, f) if os.path.isfile(savepath + fp[len(savepath)-1:]): print u'existing, not writing' else : img.thumbnail(thumbsize,Image.ANTIALIAS) w,h = img.size print (w,h) wm = (sizeblankw - w) / 2.0 hm = (sizeblankh - h) / 2.0 box2 = (int(wm) , int(hm) , int(sizeblankw - wm), int(sizeblankh - hm)) print box2 imgb.paste(img , box2) imgb.save(savepath) print 'writing file ' + fp l = len(path)list = GetFileList(path, [])with open ('result.txt','wb') as result: for e in list: e = e[l-lcur+1:] e = '- image_title: ' + e[lcur:-4] \\ + '\\r\\n image_path: \"https://raw.githubusercontent.com/yo1995/page-backup/master' + e \\ + '\" \\r\\n thumb_path: \"https://raw.githubusercontent.com/yo1995/page-backup/master' + e[:lcur-1] + '_m/'+ e[lcur:] + '\"' e = e.replace(\"\\\\\", '/') result.write(e + '\\r\\n')raw_input('finished ! press any key to exit')","categories":[{"name":"Coding","slug":"Coding","permalink":"https://yo1995.github.io/categories/Coding/"}],"tags":[{"name":"python","slug":"python","permalink":"https://yo1995.github.io/tags/python/"},{"name":"image","slug":"image","permalink":"https://yo1995.github.io/tags/image/"},{"name":"code","slug":"code","permalink":"https://yo1995.github.io/tags/code/"}]},{"title":"C# Hello World!","slug":"201608/2016-05-18-hello-world-again","date":"2016-08-28T13:43:16.374Z","updated":"2016-08-28T13:51:47.916Z","comments":true,"path":"2016/08/28/201608/2016-05-18-hello-world-again/","link":"","permalink":"https://yo1995.github.io/cht/2016/08/28/201608/2016-05-18-hello-world-again/","excerpt":"参考书籍： Microsoft Visual C# 2013 Microsoft’s DEV204x 课程，就由这里起步吧。Hello World!","text":"参考书籍： Microsoft Visual C# 2013 Microsoft’s DEV204x 课程，就由这里起步吧。Hello World! 1234567891011121314151617using System;using System.Collections.Generic;using System.Linq;using System.Text;using System.Threading.Tasks;namespace TestHello&#123; class Program &#123; static void Main(string[] args) &#123; Console.WriteLine(&quot;Hello World!&quot;); Console.ReadKey(); &#125; &#125;&#125;","categories":[{"name":"Coding","slug":"Coding","permalink":"https://yo1995.github.io/categories/Coding/"}],"tags":[{"name":"C#","slug":"C","permalink":"https://yo1995.github.io/tags/C/"}]},{"title":"The Paper Menagerie - 纸异兽","slug":"201608/2015-09-26-the-paper-menagerie","date":"2016-08-28T13:43:09.025Z","updated":"2016-08-28T13:50:33.053Z","comments":true,"path":"2016/08/28/201608/2015-09-26-the-paper-menagerie/","link":"","permalink":"https://yo1995.github.io/cht/2016/08/28/201608/2015-09-26-the-paper-menagerie/","excerpt":"原文转载 豆瓣译文转载","text":"原文转载 豆瓣译文转载 我最早的记忆之一，是以我的啜泣开头的。不管爸爸妈妈怎么哄我，我都不肯消停。 爸爸无奈的离开了我的床边，而妈妈把我带到厨房，把我安坐在餐桌旁。 “汗，汗，” 她边说边从冰箱顶上抽出一张礼品包装纸。一年又一年，妈妈小心翼翼的裁开圣诞礼物上的包装纸，再收好到冰箱顶上，攒了厚厚一沓。 她把纸平铺开，没有图案的一面向上，然后折了一下。我停止了哭闹，好奇地望着她。 她把纸翻了一面，又折了一下。她折、捏、掖、卷、揉……直到纸的原形在她合拢的双掌里消失。她将那折起的小团举向嘴边，往里吹气，像吹一个气球。 “汗，”她说，“老辅。”她把手低向桌面，摊开双掌。 一只小小的纸老虎站在桌上，像两只握紧的拳头一块儿那么大。虎皮是包装纸的图案，银白的底色，排布着红色的棒棒糖和绿色的圣诞树。 我把手伸向妈妈的创作。它的尾巴晃了晃，欢快地蹦向我的手指。“嗷~沙~”它吼道，像是介于猫儿的喵呜和翻报纸的沙沙作响之间的某种声音。 “则叫则子。”妈妈说——这叫折纸。 我那时还不知道：妈妈的折纸与别人的不同。她对折纸吹入生气，因而它们分享了她的呼吸，与她的生命共舞。这是她的秘法。 爸爸是从一本目录里挑中妈妈的。 有一次，当我上高中的时候，我问了爸爸详情。他那时正努力让我乐意再和妈妈说话。 1973年的春天，他签约了婚介服务。他有条不紊地翻着名录，一页不过瞄上几秒，直到妈妈的相片映入眼帘。 我从来也没见过这张照片，爸爸这样描述它：妈妈坐在一张椅子上，侧身对着相机，穿着一件贴身的绿色旗袍。她把头转过来正对镜头，一头乌黑长发于是滩过肩膀，瀑落胸前，如诗如画。她从照片里看着他，用宁静的稚子般的眼睛。 “我再也没有多翻一页。”他说。 目录上说她十八岁，能歌善舞，英语流利，因为她来自香港。这些没有一样是真的。 他给她写信，婚介公司帮他俩来回通讯。最终，他飞到香港去见她。 “她的回信都是公司的人写的。除了’你好’和’再见’，她一句英文也不会。”爸爸说。 什么样的女人才会把自己放进一个可以待价而沽的商品目录里？——高中生的我觉得自己什么都懂。轻蔑的感觉不错，就像酒一样。爸爸没有选择怒冲冲地找婚介公司算账，他就地在宾馆的餐厅雇来一位女服务生，为他们当翻译。 “当我说话的时候她会看着我，眼神一半是畏惧，一半是期待。当那个女孩开始翻译我说的话时，她就渐渐地微笑起来。” 他飞回康涅狄格，开始申办让她来他身边的手续。一年后我出生了，在虎年。 在我的要求下，妈妈又用礼品包装纸给我做了一只山羊、一只小鹿和一头水牛。它们会绕着客厅跑来跑去，被老辅咆哮着追逐。当他抓住它们的时候，他会狠狠扑倒它们，直到它们肚子里的气都被挤了出来，压成了平平的纸片。我就得重新给它们吹满气，这样它们又能多跑一阵子。 有时候，这些动物也会陷入麻烦。有一次，小水牛在我们晚餐时跳进了一碟酱油里（他想戏水，跟真的水牛一样）。我飞快地把他拣了出来，但毛细效应已经使得深色的酱汁高高浸湿了他的腿。湿软的四肢撑不起他的身体，他瘫倒在桌上。我把他放在太阳下晒干，可是他的腿不再平整，自此便一瘸一拐地跑来跑去。终于，妈妈把他的腿用玻璃纸包好，这样他就可以想怎么玩水就怎么玩水了（酱油除外）。 还有，和我在后院一起玩耍的时候，老辅喜欢忽然纵身一跃扑向麻雀。可是有一次，一只走投无路的鸟儿奋起反击，啄烂了他的耳朵。妈妈用透明带粘好他的耳朵时，他在我怀中呲牙咧嘴地哀号。从此他都离鸟儿远远的。 之后一天，我在电视上看到一部讲鲨鱼的科教片，便叫妈妈也给我做一条。她折了一条小鲨鱼，但他难受地在桌面上蹦跶。我给水箱灌足水，把他放了进去。他快活地游了一圈又一圈，渐渐地沉到底，散了架。我伸手想救他，却只捞上来一片湿漉漉的纸。老辅把前爪搭在水箱边沿，头埋进爪子里。耳朵耷拉着，喉咙里发出低沉的嘶吼，那声音令我内疚。 妈妈又给我折了一条鲨鱼，这次是用锡纸折的。这条鲨鱼在一个大金鱼缸里快活地生活。老辅和我喜欢坐在一旁看着锡纸鲨鱼追逐着鱼缸里的金鱼，老辅把脸贴在鱼缸的壁上，在另一边的我看见他的眼睛——被玻璃放大得像咖啡杯底那么大，从鱼缸对面瞪着我。 当我十岁的时候，我们搬进了镇上另一边的新家。两个女邻居造访来表示欢迎。爸爸给她们端茶倒水，并且为必须离家赶去水电公司以肃清前任房主的账单表示歉意。“请您自便吧，我妻子不太会说英语。所以如果她没来和您打招呼，请别怪她待客不周。” 当我在餐厅看书的时候，妈妈在厨房拾掇。邻居在客厅聊天，丝毫没有说悄悄话的意思。 “他看起来是个挺正常的男人呀，为什么会做那种事呢？” “混血么，总是哪儿有点不对劲。那个孩子就像残品一样，窄长的亚洲人的眼睛，白种人的面孔。啧啧，小怪物。” “你觉得他能说英语吗？” 那个女人顿了顿。一会儿，她们走进餐厅。 “乖！你叫什么名字？” “杰克。”我说。 “这听起来并不很中国佬嘛。” 接着妈妈走进了餐厅。她对着那个女人笑了笑。三个人围着我站成一个三角形，彼此点头微笑，无话可说，直到爸爸回家。 马克，邻居家的小孩之一，带着他的《星球大战》动作玩偶来找我玩儿。当欧比旺的光剑闪亮的时候，他还能挥舞手臂，用细细的声音说：“原力在上！”。我压根不觉得这个玩偶看起有多像真正的欧比旺。 我俩一起看着他在咖啡桌上做了五次一样的表演，然后我问道：“他还能干点别的吗？” 马克被问得恼了，“仔细看呀。”他说。 我仔细的看了看，不知道接下来该说些什么。 马克对我的反应很失望，“给我看看你的玩具呗。”他说。 除了我的纸动物们，我什么玩具也没有。我从卧室把老辅拿了出来，那时候，他已经十分陈旧，身上布满了胶水和透明胶带——多年来我和妈妈修补他留下的痕迹。他再也无法像以前那样轻灵矫健。我把他安坐在咖啡桌上，我能听见他身后跟来的其他动物们细碎匆忙的步伐，怯怯地从门廊里向客厅探视。 “小老辅，”我说，又停下，换成英语，“这是老虎。”警觉地，老辅迈步向前，轻声低唤，嗅着马克的手。 马克检视了老辅身上的包装纸的圣诞图案，道：“这压根不像老虎。你妈妈都是用垃圾给你做玩具的吗？” 我从未有过老辅是垃圾的念头，垃圾？可是看着他，他的确只是一张包装纸而已。 马克又按了一下欧比旺的头，光剑闪亮，他上下挥舞手臂：“原力在上！” 老辅转身一跃，把塑料玩偶撞下了桌子。他掉在地板上，摔裂了，欧比旺的头滚到了沙发底下。“嗷~~~”老辅笑了。我跟着笑了。 马克狠狠给了我一拳，大喊大叫：“这很贵的！现在商店里都买不着了！恐怕比你爸买你妈花的钱都多！” 我失衡摔倒在地，老辅咆哮着，朝着马克的脸扑了过去。 马克尖叫起来，害怕多于疼痛。毕竟，老辅只是纸做的老虎。 马克一把抓住老辅，老辅的怒吼戛然而止——他被马克捏坏在手，撕成两半。马克把两片纸揉成一团扔给我，“还你的又蠢又贱的中国垃圾。” 马克走了之后，我花了很久很久，屡败屡战地，试图把碎纸片粘回来，把纸张整平，顺着原来的折痕把老辅折回来。渐渐地，别的动物也进入了客厅，围拢我们——我，还有那曾经是老辅的，撕碎的纸片。 我和马克的争斗并没有到此结束。马克在学校里是人气王。我一点儿也不愿去回想之后的两周是怎么过的。 在那两周末尾的周五，我放学回家。“学叫好吗？”妈妈问我。我一言不发的走进了浴室，我看着镜子里的自己——我一点也不像她，不像！ 晚饭时我问爸爸：“我有一张中国崽的脸吗？” 爸爸放下他的筷子，即使我从未告诉他学校里发生过什么，他似乎明白状况。他闭上眼，摩挲着鼻梁，说道：“不，你没有。” 妈妈看看爸爸，一脸迷茫。她又看看我，问：“森么似中国崽？” “英语，”我说，“说英语。” 她努力尝试着：“生发了什么？” 我把面前的碗筷远远推倒一边：青椒炒五香牛肉。“我们应该吃美国菜。” 爸爸试着讲理：“很多家庭都会不时做点中国菜吃。” “我们不是别人。”我看着他。别人的家庭里没有一个不属于这儿的妈妈。 他的目光转向别处。接着，他一只手搭上妈妈的肩：“我会给你买本烹饪书。” 妈妈转向我：“不好次？” “英语，”我说，声音愈来愈高，“说英语。” 妈妈伸出手，触向我的额头，感觉到我上升的体温：“发扫了？” 我挥走她的手，“我没事。说英语！”我已经在吼了。 “跟他说英语吧，”爸爸对妈妈说，“你早该料到会有这一天。你指望什么呢？” 妈妈双手垂在身侧。她坐着，从爸爸看向我，又回望爸爸。她想说点什么，却无法开口，又试着说点什么，又沉默。 “你不得不，”爸爸说，“我待你一直太宽松了。而杰克需要融入” 妈妈看了看他，“如果我说‘Love’，我的感觉在这儿，” 她指了指她的唇，“如果我说「爱」，我的感觉在这儿。”她把手扣在心口。 爸爸摇了摇头：“你在美国。” 妈妈蜷在椅子上，看起来就像那头被老辅扑倒压扁，把生气挤尽的小水牛。 “还有，我想要新玩具。” 爸爸给我买了《星球大战》全套的动作玩偶，我把欧比旺那个给了马克。 我把纸异兽收拾进一个大大的鞋盒子里，把盒子藏到床底下。 次日早晨，这些动物纷纷逃了出来，占领了我房间里他们各自惯待的据点。我把他们统统抓住，放回鞋盒，再用胶带封紧。而这些动物吵吵嚷嚷，一刻也不肯消停，以致于我不得不把他们扔到离我房间最远的阁楼的角落。 只要妈妈用中文和我说话，我就不理她。一段时间后，她开始对我多说英语。但她糟糕的口音和的遣词造句令我窘迫。我每每试着纠正她。终于，只要我在，她便什么话也不再说了。 妈妈开始像哑语一样指东指西，当她必需要告诉我些什么的时候。她试着拥抱我，就像她在电视里看到的美国妈妈们拥抱孩子的样子。可是我觉得她的动作矫揉造作、忐忑不安、滑稽可笑而且一点也不优雅。她看到了我脸上的不耐烦，从此停止。 “你不该这么对你妈妈。”爸爸说。但他无法直视着我的眼镜说这句话。心底深处，他也一定意识到：把一个中国农民的女儿硬塞到康涅狄格的郊区是个错误。 妈妈学会了烹饪美国菜式。我开始玩电子游戏，还有学习法语。 每过一段时间，我就会看到妈妈坐在厨房的餐桌旁，全神贯注地看着一张礼品包装纸没有图案的一面。不久，一个新的折纸动物就会在我的床头柜上出现，跃跃欲试地想要抱抱我。我会一把抓住它们，挤尽它们身体里的最后一丝生气，然后把它们塞进阁楼上的鞋盒里。 当我上高中的时候，妈妈终于停止了折新的小动物。那时她的英语变好了很多，可我也已经到了她说什么我都无所谓的叛逆期，管她用什么语言呢。 有时候，当我回到家里，看到她娇小的身形在厨房里一边忙碌着，一边哼着中文歌，我实在难以相信这就是生下我的女人。我们毫无共同之处。她没准是月球上来的。我快步走回房间，继续追寻我的纯正的美国式幸福。 爸爸和我一人立在妈妈一侧，她躺在医院的病床上。她还不到四十岁，可她看上去要比她的年纪老得多。 多年来，她都不肯为腹痛去看医生，她总是说没事、没什么的。直到有一天救护车把她送进了医院，而癌症已经病入膏肓。 我人在病房里，心却在别处。现在正是校园招聘的高峰季，我全心全意地准备着简历、档案还有按部就班规划好的面试。我算计着该怎么更好地粉饰夸口才能忽悠着面试官。我的理性告诉我：这不是你的妈妈卧病濒危时该想的事情。可是理性扭转不了我的感觉。 她还很清醒。爸爸用双手小心地捧起她的左手，低身吻了吻她的额头。他显出的苍老和虚弱忽然震惊了我。我意识到，我对爸爸的了解，几乎和我对妈妈的了解一样少。 妈妈朝他笑了笑：“我没事。” 她对爸爸低语了几句，他点点头，离开病房。 她转向我，依然笑着：“我知道你得回学校，”她的声音低弱，模糊在连着她的身体的医疗机器的嗡鸣中，“去吧。不用担心我。没什么的。好好学习。” 我伸手去握她的手，因为我似乎应该那么做。我一下子放松了，满脑子都是回程的航班，还有加州明亮的阳光。 “杰克，如果——”她猛地咳起来，好一阵子说不成话，“如果我—— 没挺过这次，千万别因为伤心坏了身子。好好过你自己的生活。只是保管好你放在阁楼上的那个盒子，每年，清明的那天，把它搬出来，想想我。我一直都会在你身边。” 清明是中国祭祀死人的节日。当我很小的时候，妈妈总是在清明那天给她死去的父母写一封信，告诉他们去年一年她在美国的幸福生活。她会大声把信念给我听，如果我评论了点什么，她会把我的话一起写在信里。然后她会把信折成一只纸鹤，朝着西方放开它。我们就一起看着，看着纸鹤扇动翅膀清脆作响，飞向太平洋，飞向中国，飞往妈妈的家乡。 上次我们一起过清明，已经是很多年前的事了。 “我完全不知道中国的日历是怎么算的，”我说，“妈，你就休息吧。” “那就保管好那个盒子，隔段时间打开它一下。就打开一下——”她又开始咳了。 “没事的，妈。”我别扭地拍着她的背。 “伢仔，姆妈「爱」你——”她的咳嗽又占了上风。一幅陈旧发黄的画面忽然闪过我的脑海：妈妈说着「爱」这个字，把手扣在心口。“好了，妈，别说话了。” 爸爸回到了病房，我告诉他我需要早点赶去机场，免得错过航班。 她死了，当我的飞机在涅华达某处上空的时候。 妈妈死后，爸爸老得特别快。原来的独屋对爸爸一个人来说实在太大，他决定卖了它。我和女朋友苏珊一起去帮他收拾打扫。 苏珊在阁楼里找出了那个鞋盒子。那些纸异兽，长期深藏在不见天日的阴暗阁楼中，已经又软又脆，原来礼品包装纸上色彩斑斓的图案亦退色暗淡。 “我从没见过这样的折纸，”苏珊惊叹，“你妈妈是个了不起的艺术家。” 那些折纸动物一动不动。也许不管是什么曾驱动他们的魔法，都和妈妈一起死去了。也许他们曾经的活蹦乱跳，从头到尾只是我的幻想罢了，小孩子的记忆怎么可信呢？ 那是四月的第一个周末，妈妈过世两年后。大忙人咨询师苏珊又出差了，我待在家里，懒洋洋地换着电视频道。 我停在一个放着鲨鱼科教片的节目。忽然间，我的眼前浮现了妈妈的双手，巧手翻覆，折出一只小小的锡纸鲨鱼，老辅和我在一旁全神看着。 窸窣一声。我抬起头，看到一团黏着破胶带的礼品包装纸在书架脚边的地板上抖动。我走过去，想把它扔到垃圾筒里。 那团废纸倏忽撑高，自己塑出形来。我看见了老辅，原来是被我遗忘多时的老辅。“嗷~沙~” 当年我放弃他之后，一定是妈妈又把他收起来了。 他比我记忆中的要小。或者，只是当年我自己的拳头比较小吧。 苏珊把折纸动物左一处右一处地摆在公寓里，作为装饰。估计因为老辅看起来太破烂了，所以被她搁在了隐蔽的角落。 我坐在地板上，向他伸出一只手指。老辅的尾巴摇了摇，快活地蹦了过来。我哈哈笑着，摩着他的后背，老辅在我掌下轻声低唤。“你过得怎样，老伙计？” 老辅停下了玩闹。他立起身，轻灵一跃到我的腿上，接着自行铺展开来。 现在，我的腿上是一张折旧了的包装纸，没有图案的一面朝上。纸上写遍布着密密的中文汉字。我从来也没好好学过认字，但我认识“儿子”这两个汉字。它们在最上角，那个应该是写着收信人的地方，用妈妈别扭的、孩子气的笔迹。 我走到电脑前，打开网页：今天是清明节。 我带着那封信冲到了市中心，中国游客的大巴常驻的地方。我拦下每个游客，问着：“哩会读宗文吗？”——你会读中文吗？我太久没有说过中文，不知道对方听懂了没有。 一个年轻女子答应帮我。我们在一同在一张长椅坐下，她大声对我读出信的内容。那门多年来我一直试图遗忘的语言又回来了，一字一句，浸入我的皮肤，穿透骨髓，紧紧攥住我的心。 儿子， 我们好久没有说过话了。我害怕每当我想要碰触你时你恼火的样子。还有，我一直都有的腹痛，现在可能是个事了。 所以我决定给你写信。我会把信写在这些我给你折的纸动物里，你以前多喜欢他们呢。 当我停止呼吸的时候，这些动物也不会动了。但是如果我用全部的真心给你写信，我就能留存一点点的自我在这张纸上，在这些文字中。那么，如果你在清明节想起我，在逝者的魂灵得允回访亲人的日子，你能让这些余下的一部分的我又重新活起来。我为你折的这些造物又会再次奔跑跳跃，也许，那时你就能看见这些文字了。 因为我必须全心全意给你写信，我得用中文。 一直以来，我都没有告诉过你我的身世。当你还小的时候，我总是想，等你大一点懂事了再说吧。可是，我就再没有开口的机会了。 我1957年出生在河北的四轱辘村。你的外公外婆都来自人丁稀落的贫农家庭。我出生没几年，饿死了三千万人的大饥荒席卷中国。我最初的的记忆便是，我的母亲吃着泥巴充饥，为了能省下最后一点面粉喂给我。 之后的生活渐渐好起来，四轱辘村以它的折纸手艺而闻名，我的母亲教会了我怎么折纸动物，再让它们活起来。这是村里传承的秘法。我们折纸鸟儿驱除田地里的害虫，折纸老虎赶走屋里的耗子。在中国春节，我和朋友们一起折赤红的纸龙。我永远也不会忘记那画面：一条条小小的纸龙在头顶的空中蜷舒，抓起一串串噼啪炸响的爆竹，送走旧岁。如果你看见，也一定会喜欢的。 然后，1966年，文革来了。邻里反目，兄弟阋 墙。有人想起了我的舅舅，他1946年去了香港，在那儿经商定居。有个在香港的亲戚就意味着我们是间谍、是人民的敌人，我们只能在夹缝中求生。你苦命的外婆——她无法忍受种种凌虐，跳井了。接着有一天，一群带着土猎枪的小伙子把你外公拽进一片小树林，他再也没有回来。 剩下我，一个10岁的孤儿。我仅存的亲人只有在香港的舅舅。一天夜里，我逃走了，搭上了一趟南下的货运火车。 数日后的广东，几个男人逮住了正在偷东西吃的我。听说我想去香港的时候，他们大笑： “今天是你的吉日，我们做的就是带女仔去香港的生意。” 他们把我和别的小女孩一起藏在一辆卡车底部，带我们偷渡过境。 我们被带到一处地下室，按他们说的站直、打起精神，好讨买家欢心。光顾的家庭付给仓库一笔钱，过来打量挑选出我们中的一个“领养”。 秦家选中了我来照看家里的两个男孩。我每天早晨4点起床准备早餐，给两个少爷喂饭洗澡，还有买菜，洗衣，拖地。我跟着他们，唯命是从。晚上我被锁在厨房的碗柜里睡觉。动作慢了或者做错事了我会挨打，少爷做错事了我会挨打，如果他们抓住我试图学点英文，我也会挨打。 “你为什么想学英文？”秦先生问我，“你想去警察局吗？我们会跟警察举报你这个非法居留的大陆妹。他们会很乐意把你关进监狱里的。” 整整六年，我都是这样过的。有一天，一个早市卖鱼的老妇悄悄把我拉到一边。 “我见过不少像你这样的女孩子。你多大了，十六？有一天，你的男主人会喝多，然后他会盯着你，再一把拉住你……你没法反抗，直到有一天被你的女主人发觉，那时候，你才知道什么叫人间地狱。你得摆脱那种人生。我认识人能帮你。” 她给我讲了许多想讨个亚洲老婆的美国男人的故事。只要我能烧饭，打扫，照顾我的美国丈夫，他就能给我个好日子过。那是我当时唯一的希望。这就是我怎么登上那本满是假话的目录，遇到你爸爸的经过。这不是一个浪漫的故事，但，这就是我的故事。 在康涅狄格的郊区，我很孤独。你爸爸对我温柔又诚挚，我很感激他。但是没人懂我，我也什么都不懂。 然后你出生了！当我看到你的脸，看见我的父亲、母亲、还有我自己的影子，我是多么的幸福。我失去了整个家，四轱辘的所有，我曾经熟悉过、深爱过的一切。可是，我有了你，你的脸就是证明，它如此真实。这不是梦。 现在我有了说话的人。我会教你我的语言，我将和你一起，一点点的拼凑起我曾经爱过又失去了的一切。当你第一次开口说话，用中文，用我和我的母亲一样的口音，我哭了好久好久。当我给你做好第一只折纸动物，你破涕为笑的那一刻，仿佛全世界的忧虑都一扫而空。 你又长大了一点，现在甚至都能当爸爸和我之间的小翻译了。我才真正有了家的感觉。我终于过上了好日子。我多希望我的父母也在这儿，我能给他们烧饭端菜，让他们也过上好日子。可我的父母早已不在了。你知道中国人心中最为悲哀的事是什么？树欲静而风不止，子欲养而亲不待。 儿子，我知道你不喜欢你的中国眼睛，那是我的眼睛。我知道你不喜欢你的中国头发，那是我的头发。可是你知道吗，仅仅是你的存在本身，就带给了我数不尽的喜悦？你又能否明白，当你不再和我说话，也不准我和你说中文的时候，我是什么感觉？我觉得，我再次失去了一切。 儿子，为什么你不肯和我说话？我痛得写不下去了。 年轻女子把那张纸交还给我，我不敢面对她的眼神。 低着头，我请求她帮忙把妈妈信中的「爱」都划出来。我反复在那张纸上描着这个字，用笔触抚摩她的字迹，一遍又一遍。 年轻女子伸出手，拍拍我的肩。然后她起身离去，剩下我一个人，和妈妈的思念。 顺着折痕，我把那张纸折回成老辅。我把他兜在怀中，他轻声低唤着，同我一起回家去。","categories":[{"name":"Reading","slug":"Reading","permalink":"https://yo1995.github.io/categories/Reading/"}],"tags":[{"name":"reading","slug":"reading","permalink":"https://yo1995.github.io/tags/reading/"}]},{"title":"Days in semi.ac - 1","slug":"201608/2016-08-25-CAS-semi-1","date":"2016-08-28T13:42:51.967Z","updated":"2016-08-28T13:51:22.269Z","comments":true,"path":"2016/08/28/201608/2016-08-25-CAS-semi-1/","link":"","permalink":"https://yo1995.github.io/cht/2016/08/28/201608/2016-08-25-CAS-semi-1/","excerpt":"在半导体所的经历 - 1","text":"在半导体所的经历 - 1 Institute of Semiconductors Chinese Academy of Sciences, which is known as semi.ac, is the major research facility of the frontier technology of the semiconductor industry and science in China. I’ve been in the semi.ac since last summer in 2015. After a year of studying and practicing, I didn’t achieved much in the research group. But I really gained some valuable experience in this period of time. Tours and Conferences{:.hascaption}The first time I went to the institute was in May, 2015. The students and professors there gave our undergraduates a concise introduction about the fields of their researches, including nano-electronics, femtosecond-laser devices, nano-structures and microwave photons, bio-electro, semiconductor and diodes and some other things. It’s pretty a brand new impression to me as I see all this tubes wandering about in the facility, filled with liquid nitrogen. There are also some really hug device such as the MOCVD and MBE and Photoluminescence Spectroscopy device. {:.hascaption}{:.hascaption}{:.hascaption}In autumn, we went there for a meeting. The academician’s report introduced the biography of Huang Kun, the founder or Huang’s equation and the industry of solid state physics in China. A cartoon which depicts the life of Huang at Raman Lab vividly showed the hardship and incovenience at that time: he had to raise pigs and chicken while dealing with his research works ! After seeing this picture, all the students and teachers smirked with joy. The director even get so excited as the photo above… {:.hascaption}{:.hascaption}{:.hascaption}The other day we tour some labs. One of them deal with the Visual Ligh Communication issue. It happened that I was doing some research on that topic then, and I got a lot of inspiration from them. We maintained solid connection for about half a year and I finished up with a prototype VLC device with the help of them. The other lab mainly focus on the nano-material subject and we got closed enough to observe the operation of a MBE. 从去年夏天到2016年2月左右，基本去半导体所基本就是参观和简略了解内容。然而，始终没有实际进行研究不能让我们得到更多的提升。因而，我和另外三个同学先是参与了有关三五族材料制备染料敏化太阳能电池和研究的工作，包括微纳加工等等的内容。之后又独自参与了有关光学微腔的研究。 Currently, I’m doing some research on the topic of microcavity and whispering gallery mode optical device. Did some simulation and analysis. You may want to check it out in my album and other blogposts.","categories":[{"name":"Physics","slug":"Physics","permalink":"https://yo1995.github.io/categories/Physics/"}],"tags":[{"name":"Physics","slug":"Physics","permalink":"https://yo1995.github.io/tags/Physics/"},{"name":"semiconductor","slug":"semiconductor","permalink":"https://yo1995.github.io/tags/semiconductor/"},{"name":"Experiments","slug":"Experiments","permalink":"https://yo1995.github.io/tags/Experiments/"},{"name":"School","slug":"School","permalink":"https://yo1995.github.io/tags/School/"}]},{"title":"ASM no longer supports impact factors","slug":"201608/2016-07-12-no-longer-if-support-for-asm","date":"2016-08-28T13:42:51.966Z","updated":"2016-08-28T13:52:04.277Z","comments":true,"path":"2016/08/28/201608/2016-07-12-no-longer-if-support-for-asm/","link":"","permalink":"https://yo1995.github.io/cht/2016/08/28/201608/2016-07-12-no-longer-if-support-for-asm/","excerpt":"As the announcement posted on July 11, 2016, American Society for Microbiology (ASM) no longer supports impact factors for its journals:[^1]","text":"As the announcement posted on July 11, 2016, American Society for Microbiology (ASM) no longer supports impact factors for its journals:[^1]Washington, DC – July 11, 2016 - The editors-in-chief of ASM journals and ASM leadership have decided to no longer advertise the impact factors of ASM journals on the journals’ websites. This decision was made in order to avoid contributing to a distorted value system that inappropriately emphasizes high IFs. High-IF journals limit the number of accepted articles to create a perception of exclusivity, and individuals receive disproportionate rewards for articles in high IF journals, while science as a whole suffers from a distorted values system and delayed communication of research. It is the hope of ASM journal editors-in-chief and ASM leadership to move away from this system and the undue focus on journal IF, which detracts from the advancement of scientific research, by removing IFs from ASM journal websites. In doing so, ASM hopes to make a statement of principle that other journals will follow. Calculated by various companies and promoted by publishers, journal impact factors (JIFs) are a measure of the average number of citations that a journal’s articles receive over the past two years. They were designed to indicate the quality of journals, but researchers often use the metric to assess the quality of individual papers — and even, in some cases, their authors.[^2] “To me, what’s essential is to purge the conversation of the impact factor,” says ASM chief executive Stefano Bertuzzi, a prominent critic of the metric. “We want to make it so tacky that people will be embarrassed just to mention it.” Refs: [^1]: ASM Media Advisory: ASM No Longer Supports Impact Factors for its Journals [^2]: Beat it, impact factor! Publishing elite turns against controversial metric","categories":[{"name":"Physics","slug":"Physics","permalink":"https://yo1995.github.io/categories/Physics/"}],"tags":[{"name":"Impact Factors","slug":"Impact-Factors","permalink":"https://yo1995.github.io/tags/Impact-Factors/"}]},{"title":"Coding.net mirror for the blog","slug":"201608/2016-08-28-coding-net-backup","date":"2016-08-28T13:42:33.035Z","updated":"2016-08-28T13:52:47.969Z","comments":true,"path":"2016/08/28/201608/2016-08-28-coding-net-backup/","link":"","permalink":"https://yo1995.github.io/cht/2016/08/28/201608/2016-08-28-coding-net-backup/","excerpt":"","text":"设定ssh公钥截止日期2017.1，毕业前及时更换所有注册邮箱。 coding-pages设置相关默认分支为coding-pages，默认域名为{username}.coding.me，可绑定域名。 访问速度更换了以后确实访问速度提升很多，但制约速度的主要因素还是一些文件的载入。尤其是js。 其它之前尝试采用git到多个分支的方法：更改.git目录下config文件，增加pushurl = git@git.coding.net:{username}/{username}.git即可推送至多个仓库同一分支。然而因为coding默认分支与github不相同，因而无法使用此方法。 同时，由于不同页面的config.yml亦存在一些差异，因而放弃同目录多远程仓库推送，改为双目录。准备以后coding更新速率低于github，每周同步一次这样。","categories":[{"name":"html","slug":"html","permalink":"https://yo1995.github.io/categories/html/"}],"tags":[{"name":"html","slug":"html","permalink":"https://yo1995.github.io/tags/html/"},{"name":"Jekyll","slug":"Jekyll","permalink":"https://yo1995.github.io/tags/Jekyll/"},{"name":"Git","slug":"Git","permalink":"https://yo1995.github.io/tags/Git/"}]},{"title":"Google Fonts and substitution","slug":"201608/2016-08-27-googleapis-substitution","date":"2016-08-28T13:42:33.034Z","updated":"2016-08-28T13:52:28.247Z","comments":true,"path":"2016/08/28/201608/2016-08-27-googleapis-substitution/","link":"","permalink":"https://yo1995.github.io/cht/2016/08/28/201608/2016-08-27-googleapis-substitution/","excerpt":"终于搭建好博客以后，总会有一些小的改动。有时候这些改动是因为自己喜新厌旧，而有时候则是不得已而为之。","text":"终于搭建好博客以后，总会有一些小的改动。有时候这些改动是因为自己喜新厌旧，而有时候则是不得已而为之。 googleapis的怨念在搭建本页面之初，我就已经考虑过墙的问题了。为此，常用的评论，统计等系统都已经找了墙内的替代品。然而，当一切安定后，再次测试访问我的首页时，仍旧是慢的要死…… F12走起，往下一翻，果不其然，还是有漏网之鱼。fonts.googleapis.com赫然在目。本着对谷歌疑罪从有的理念，马上着手解决这个问题。 几种解决方案字体问题无非是几种解决方案： 本地字体下载 - 然而这样的话别人也看不到炫酷的特效了啊 字体库推送到远程，用户从github服务器下载 - 尽管现在吉特哈布挺快，但保不齐敏感时期就会被干啊……算啦算啦 在线字体库…… 显而易见，在线字体库是最好的选择。不需要占用存储资源，调用方便。于是便知乎找了一下。 服务器端法1$ npm install -g goog-webfont-dl 国人总是有新办法……还会开发这种蛋疼的工具，全拜功夫网所赐啊。用法如下： 1$ goog-webfont-dl -a -f 'Source Sans Pro' -y '300,400,600,900' 工具会自动下载所需web字体并生成css，调用就是了。 换源法感谢中科大源，无数次拯救我于墙内。换源方法如下：fonts.googleapis.com → fonts.lug.ustc.edu.cn [^1]: 知乎 - 关于字体被GFW的解决方案","categories":[{"name":"html","slug":"html","permalink":"https://yo1995.github.io/categories/html/"}],"tags":[{"name":"html","slug":"html","permalink":"https://yo1995.github.io/tags/html/"},{"name":"css","slug":"css","permalink":"https://yo1995.github.io/tags/css/"},{"name":"GFW","slug":"GFW","permalink":"https://yo1995.github.io/tags/GFW/"}]},{"title":"Jekyll 新坑之 Hello my new blog !","slug":"201608/2016-08-25-helloworld-jekyll","date":"2016-08-28T13:42:33.033Z","updated":"2016-08-28T13:52:17.782Z","comments":true,"path":"2016/08/28/201608/2016-08-25-helloworld-jekyll/","link":"","permalink":"https://yo1995.github.io/cht/2016/08/28/201608/2016-08-25-helloworld-jekyll/","excerpt":"关于github-pages","text":"关于github-pages 8月15日开始的github-pages之旅，之前参考了北邮人论坛上Java版的一篇帖子。帖子中很多人都推荐使用hexo + gh-pages搭建一个现代化的静态博客。我自然不能免俗，最喜欢用人家用的成熟的开源产品了，功能丰富，可定制性更强。 关于上一个页面戳这里！上一个页面其实挺好看的，非常符合我自己的审美：三栏式、有文档和标签功能、站内静态搜索、丰富的自定义方法。加之hexo用起来确实很方便，hexo clean、hexo g -d，敲几个字母就可以轻松发博客，不用考虑git相关的麻烦事……所以我着实花了一点功夫在那个页面上。而且也取得了一些进展。最主要的就是给那个页面增添了一个相册的功能。另外就是一些小的改动，比如主题加载中的小bug、对于标签逻辑的优化、对于flash的支持、thumbnail和banner等等小细节。总之，那个页面如果现在给人fork走，肯定比最开始的强不少。 然而，促成我最终投奔jekyll的原因恰恰就是这个相册功能。作为传统博客的重度用户，我实在难以忍受一个相册功能羸弱的“轻博客”。因而，我也在构建自己博客的同时寻觅一个具有风格美观、功能完整、响应式设计的新型博客。由于hexo作者先天并未给hexo的主题设置相册相关的接口，因而仅有寥寥无几的主题作者自己定制了相册。这其中就包括了Yilia主题，以及我定制的Icarus主题。 Yilia主题对相册的支持是通过Instagram的外链制得的。由于我的照片不多，很难超过github单一repo大小的限制，因而考虑直接把github作为图床(⊙﹏⊙)b。考虑到国内github访问速度并不慢(目测有cdn)，这样做还是很方便的。 具体操作细节在我另一篇关于相册的博客中有写。戳这里！ 总之，花了大概五天时间，终于打理好一个博客了。眼看着就可以投入使用了，结果…… 见异思迁偶尔在逛知乎时候看到：秀博客尼玛，这种帖子下面各种秀个人博客啊……完全可以想象一群没被收录的个人博客背后，全是一个个等待认可的怪蜀黍！不管了，点了几个看一看。真棒啊……再看看自己的博客，虽然比大众脸NexT、Yilia、Nova之类的稍微强点，但和人家一笔真是气死人啊！罪恶的念头从心底萌生：我也要一个颜值超高的博客！不不不，是 颜值最高的博客捂脸跑 寻找目标圈定，自然就开始左转转右看看。看来看去发现wordpress虽然泛滥成灾，但依然历久弥新，很多模板十分值得借鉴。可惜，wordpress的模板并不能直接拿到jekyll里面用，不过区别倒也不算很大。找来找去，千辛万苦，终于走到了一个网站：OmniaVlthemes作为envato旗下的网站，质量自然很有保障。想当初envato的AE模板无数次救场啊……之后的千难万险与艰苦卓绝就一笔带过了，总之我终于找到了一个自己满意的风格！ 适配我敢说这个主题是github上独一无二的。无它，光是适配就要消耗掉一个业余开发者所有的热情。jekyll因为出现的比较早，很多设计都不如hexo那么直接而简洁，因而有时需要把目录结构画到纸上，把网页各部分区域标出来才好定制内容。因为hexo积累了一定经验，用了大概两天时间吧，把这个主题适配完成了。当first commit正在上传时，那种紧张的心情是最快乐的。当然，肯定是一堆bug啦…… 适配GFW功夫网的存在让我不得不去掉原本自带的disqus评论系统和谷歌分析模块。对应的替代方案是多说和百度站长并没有用这些东西因为在hexo用过一遍，轻车熟路就给配好了。 站内搜索 - Simple Jekyll Search原本是用的谷歌站内搜索，换起来着实费了一点脑筋。首先百度用中文搜索，得到的结果自然是百度内嵌站内搜索的方案……实在太难受了，坚决不用百度！然后想到了Icarus作者自带的insight静态搜索，决意找个类似的方案。 之后找到的第一个方案是lunr.js，光是安装就有八个步骤。而我第一个步骤就卡住了……1$ gem install jekyll-lunr-js-search 然后就是各种报错，大致意思就是编译失败。我去一个js居然还要编译，ruby我跟你什么仇什么怨…… 本着坚决不看ruby文档的倔强，在尝试了三个小时后我去github搜了一搜，居然有同名替代方案……得来全不费工夫……吗？又花了三小时发现那个替代方案依旧跑不起来。一天就这么结束了…… 转天，找到了现在用的第三个方案，很好用，但有小bug，主要是和liquid不兼容。改了一下filter文件，第一次写了几行ruby代码，跑起来了，运转良好！感天动地啊~ 如果想使用这个静态搜索，可以在blog页面下尝试。顺便提一句静态搜索，其实对于个人页面很好用，只需要把所有文本内容进行采样并存储，通过一些搜索的手段就可以定位所有文章链接。Google真的是杀鸡焉用牛刀了。 目前的bug目前仍旧有两个小bug 相册页面照片图册对齐和张数问题：会多出一个空白页，另外就是横竖照片没统一情况下照片的对齐存在问题 博客页面少于12篇博客载入异常。这个主要由于异步载入写死了。目测多写几篇就好了……","categories":[{"name":"html","slug":"html","permalink":"https://yo1995.github.io/categories/html/"}],"tags":[{"name":"html","slug":"html","permalink":"https://yo1995.github.io/tags/html/"},{"name":"helloworld","slug":"helloworld","permalink":"https://yo1995.github.io/tags/helloworld/"},{"name":"Jekyll","slug":"Jekyll","permalink":"https://yo1995.github.io/tags/Jekyll/"},{"name":"css","slug":"css","permalink":"https://yo1995.github.io/tags/css/"},{"name":"github","slug":"github","permalink":"https://yo1995.github.io/tags/github/"}]},{"title":"Icarus主题-相册解决方案","slug":"the-evolution-of-the-album-page","date":"2016-08-19T14:25:23.000Z","updated":"2016-09-01T09:14:52.662Z","comments":true,"path":"2016/08/19/the-evolution-of-the-album-page/","link":"","permalink":"https://yo1995.github.io/cht/2016/08/19/the-evolution-of-the-album-page/","excerpt":"Icarus主题-相册解决方案","text":"Icarus主题-相册解决方案 前言为了蛋疼的执念，也为了对百度空间的缅怀，自己执意要添加一个相册模块。不需要很复杂，简单就好主要需求有： 能够展示照片（废话） 能够点击照片放大 能够左右翻阅照片 随着页面滚动分段加载 能够显示照片对应文件名 自适应排列 github对比vps的主要优势在于其不限制流量、访问数等等参数，且国内外访问速度都不慢。作为一个图床比较合适。可惜github对于单仓库貌似有1GB大小限制。由于并不需要传大文件，暂时忽略这个问题。 起手干完以后发现网上的方案都是天才吖~ 屎 主要参考了yilia主题的两篇博文：http://luckykun.com/work/2016-05-20/hexo-advance.html#修改themes-yilia-js-photo-js：http://zlwis.me/photo/ 关于fancybox：一般博文里使用直接用以下方式即可：http://sowm.cn/aips/article/0E1C44647F2F34C99E070ACF324407E7.html123456/*** Fancybox tag** Syntax:* &#123;% fancybox /path/to/image [/path/to/thumbnail] [title] %&#125;*/ 先去看fancybox的documentation。用起来比较简单，直接调用就好1$('.fancybox').fancybox(); 由于Icarus主题作者ppoffice贴心地在main.js配置好了fancybox载入相关的内容，我们只需要将需要载入的图片调整好标签的格式就行。于是乎，就按照上面的需求开始设计这个相册。 首先建立导航栏中的相册gallery分类；其次在该分类下放indexpage。index.md配置如下：12345678910111213---title: 相册layout: \"page\"comments: falsenoshare: true---&lt;link type=\"text/css\" href=\"/cht/vendor/fancybox/jquery.fancybox.css\" rel=\"stylesheet\"&gt;&lt;script src=\"https://7.url.cn/edu/jslib/comb/require-2.1.6,jquery-1.9.1.min.js\" type=\"text/javascript\"&gt;&lt;/script&gt;&lt;div class=\"instagram\"&gt; &lt;section class=\"archives album\"&gt; &lt;ul class=\"img-box-ul\"&gt;&lt;/ul&gt; &lt;/section&gt;&lt;/div&gt; 此处加入了一个require.js。主要原因在于作者没有学过js也不想看文档，就想照猫画虎。参考的博主是这么做的，直接学习。需要注意的是，requirejs使用时有一些限制，具体需要参考其文档。一个错误使用方法造成的报错可参考以下页面：http://luckykun.com/photos/http://requirejs.org/docs/errors.html#mismatch报错：Uncaught Error: Mismatched anonymous define() js的修改由于yilia主题和icarus主题所用的js不尽相同，文件夹结构也不同，很多地方需要调整。首先，为了区分相册页面中的图片与普通博文中的图片，上面在标签中添加了Instagram的属性。在main.js中需要对这个标签进行处理：12345678910//instaif($('.instagram').length) &#123; var bp = document.createElement(\"script\"); bp.src = \"/js/photo.js\"; var s = document.getElementsByTagName(\"script\")[0]; s.parentNode.insertBefore(bp, s), require(['/js/photo.js', '/js/jquery.lazyload.js', '/vendor/fancybox/jquery.fancybox.js'], function(obj) &#123; obj.init(); &#125;);&#125; 接着来到require到的三个js。首先是photo.js主要实现的功能就是从另一个repo中读取照片链接，在页面上加载并改变尺寸装到fancybox里，最后实现滚动异步加载。为了节省空间并没有专门生成thumbnail，只得以费流量为代价了（不痛不痒）具体实现请参考仓库中代码（偷懒） 主要难点其实没啥难点，就是因为自己比较倔非得不看文档瞎写。 总之，实现请参考：https://yo1995.github.io/cht/gallery/ 终于搞定了，最后在fancybox的css中加一项12345.img-box-ul li &#123; float: left; list-style-type:none; margin: 18px;&#125; 这样可以使图片列表横向载入 最后网上的方案看的我尴尬都犯了，有个用一样主题的家伙直接用fancybox加载结果还是一堆叉叉……自己写的总还是费了点脑筋的…… 8.19 更新又重新倒腾了一下，主要解决了横向排列的适配问题。可以考虑的方案主要有两种： clearfix + float: left display: inline 本文采用了后一种方案，主要为了定死相册显示的样式。另外更新了标签中关于图片标题的展示方法。","categories":[{"name":"html","slug":"html","permalink":"https://yo1995.github.io/categories/html/"}],"tags":[{"name":"hexo","slug":"hexo","permalink":"https://yo1995.github.io/tags/hexo/"},{"name":"js","slug":"js","permalink":"https://yo1995.github.io/tags/js/"},{"name":"html","slug":"html","permalink":"https://yo1995.github.io/tags/html/"},{"name":"cs","slug":"cs","permalink":"https://yo1995.github.io/tags/cs/"}]},{"title":"︽ About this page","slug":"About-this-page","date":"2016-08-15T07:17:56.000Z","updated":"2016-08-19T14:40:08.666Z","comments":true,"path":"2016/08/15/About-this-page/","link":"","permalink":"https://yo1995.github.io/cht/2016/08/15/About-this-page/","excerpt":"The main purpose of this page","text":"The main purpose of this page建立本页面的目的The main purpose of this page 建立此页面主要为展示本人本科期间所从事的各项活动，并借此熟悉Markdown与hexo","categories":[{"name":"helloworld","slug":"helloworld","permalink":"https://yo1995.github.io/categories/helloworld/"}],"tags":[{"name":"Description","slug":"Description","permalink":"https://yo1995.github.io/tags/Description/"}]},{"title":"Hello World & hexo notes","slug":"hello-world","date":"2016-08-14T16:53:41.002Z","updated":"2016-08-26T03:29:08.693Z","comments":true,"path":"2016/08/15/hello-world/","link":"","permalink":"https://yo1995.github.io/cht/2016/08/15/hello-world/","excerpt":"记录使用hexo与自定义的相关历程。Record the process of the development of this page.","text":"记录使用hexo与自定义的相关历程。Record the process of the development of this page. 原模板自带简介Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment 以下为个人记录常规操作类生成并部署1$ hexo generate --deploy 清空本地生成1$ hexo clean 字号调整_variables.styl文件 图片视频类视频：iframe标签、或者video标签：1234567&lt;embed type=\"video/mp4\" allowscriptaccess=\"always\" allowfullscreen=\"true\" wmode=\"transparent\" quality=\"high\" height=\"300\" width=\"480\" src=\"http://7.com/3.mp4\"/&gt;&lt;iframe height=498 width=510 src=\" \" frameborder=0 allowfullscreen&gt;&lt;/iframe&gt;&lt;video width=\"498\" height=\"510 \" src=\" \" poster=\" \" autoplay=\"autoplay\"&gt;&lt;/video&gt;&lt;embed src=\"/cht/css/images/banner-flash.swf\" allowFullScreen=\"true\" quality=\"high\" width=\"480\" height=\"400\" align=\"middle\" allowScriptAccess=\"always\" type=\"application/x-shockwave-flash\"&gt;&lt;/embed&gt; 加入置顶功能node_modules/hexo-generator-index/lib/generator.js12345678910111213141516171819202122232425262728'use strict';var pagination = require('hexo-pagination');module.exports = function(locals)&#123; var config = this.config; var posts = locals.posts; posts.data = posts.data.sort(function(a, b) &#123; if(a.top &amp;&amp; b.top) &#123; // 两篇文章top都有定义 if(a.top == b.top) return b.date - a.date; // 若top值一样则按照文章日期降序排 else return b.top - a.top; // 否则按照top值降序排 &#125; else if(a.top &amp;&amp; !b.top) &#123; // 以下是只有一篇文章top有定义，那么将有top的排在前面（这里用异或操作居然不行233） return -1; &#125; else if(!a.top &amp;&amp; b.top) &#123; return 1; &#125; else return b.date - a.date; // 都没定义按照文章日期降序排 &#125;); var paginationDir = config.pagination_dir || 'page'; return pagination('', posts, &#123; perPage: config.index_generator.per_page, layout: ['index', 'archive'], format: paginationDir + '/%d/', data: &#123; __index: true &#125; &#125;);&#125;; 加入gallery功能，每次更新文件时需运行1234567python pcp.pynode tool.jscd photos/page-backupgit add .git commit -m 'upload'git status -sgit push 关于asset-img文件夹的解决方案之一http://www.tuicool.com/articles/umEBVfI目前自己解决的办法是放到css/thumbnail绝对路径下，肯定没错就是有点不优雅 增加swf-flash文件作为banner功能：·添加post/swf.ejs文件12&lt;a href=&quot;&lt;%- url_for((post.link ? post.link : post.title)) %&gt;&quot; target=&quot;_blank&quot; itemprop=&quot;url&quot; class=&quot;flash&quot;&gt;&lt;/a&gt; &lt;embed src=&quot;&lt;%- post.swf %&gt;&quot; allowFullScreen=&quot;true&quot; quality=&quot;best&quot; width=&quot;100%&quot; height=&quot;100%&quot; align=&quot;middle&quot; allowScriptAccess=&quot;always&quot; scale=&quot;noborder&quot; type=&quot;application/x-shockwave-flash&quot; class=&quot;flash-banner&quot;&gt;&lt;/embed&gt; ·修改article.ejs文件:123&lt;% if (post.swf) &#123; %&gt; &lt;%- partial(&apos;post/swf&apos;) %&gt; &lt;% &#125; %&gt; front-matter相关修改noshare属性12&lt;% if (!post.noshare) &#123; %&gt;&lt;% &#125; %&gt; 这样加入noshare属性并设置为true即可关闭分享功能 关于favicon.ico这年代缩略图标各家差别太大为了适配安卓和苹果，找到了一个好用的网站：http://realfavicongenerator.net/可以生成对应的html代码和图片文件。有兴趣可以把本网站“添加到主屏幕”试试;-)对了，还要修改_congfig.yml ，以及head.ejs文件相应位置哦 fancyboxhttp://fancyapps.com/fancybox/#docs有众多属性可以使用，还可以点击播放swf 题外话：关于pipeasy_install -U pip","categories":[{"name":"helloworld","slug":"helloworld","permalink":"https://yo1995.github.io/categories/helloworld/"}],"tags":[{"name":"js","slug":"js","permalink":"https://yo1995.github.io/tags/js/"},{"name":"html","slug":"html","permalink":"https://yo1995.github.io/tags/html/"},{"name":"test","slug":"test","permalink":"https://yo1995.github.io/tags/test/"}]}]}